app/Http/Controllers/Admin/Pelanggaran/SiswaController.php

    public function index(Request $request) {
    	if ($request->ajax()) {
            $data = Siswa::latest()->get();
            return DataTables::of($data)
                ->addColumn('action', function ($data) {
                    $button = '<button type="button" id="'.$data->id.'" class="edit btn btn-mini btn-info shadow-sm">Edit</button>';
                    $button .= '&nbsp;&nbsp;&nbsp;<button type="button" id="'.$data->id.'" class="delete btn btn-mini btn-danger shadow-sm">Delete</button>';
                    return $button;
                })
                ->rawColumns(['action'])
                ->addIndexColumn()
                ->make(true);
        }

        $kategori = Pelanggaran::all();
    	$sanksi = Sanksi::all();
---
select * from `pelanggarans` where `pelanggarans`.`deleted_at` is null
select * from `sanksis` where `sanksis`.`deleted_at` is null