app/Http/Controllers/API/AbsensiController.php

select * from `absensis` where `absensis`.`siswa_id` in (1, 2, 3, 4, 5, 6, 7) and `tanggal` >= '2021-02-18' and `tanggal` <= '2021-02-19'
select * from `siswas` where `id_tingkatan_kelas` = '1' and `siswas`.`deleted_at` is null order by `nama_lengkap` asc
select * from `tingkatan_kelas` where `tingkatan_kelas`.`id` in (1) and `tingkatan_kelas`.`deleted_at` is null
---
    public function read(Request $request) {
        if($request->req == 'table') {
            $data = Siswa::with(['kelas',
                                 'absensi' => function($q) use($request){
                                     $q->where('tanggal', $request->tanggal)->where('kelas_id', $request->kelas_id);
                                }])
                         ->where('id_tingkatan_kelas', $request->kelas_id)
                         ->orderBy('nama_lengkap')
                         ->get();

                         return ResponseFormatter::success($data);
        }

        elseif($request->req == 'rekap') {
            $data = Siswa::where('id_tingkatan_kelas', $request->kelas_id)
                        ->with('kelas')
                        ->orderBy('nama_lengkap')
                         ->with(['absensis' => function($q) use($request){
                             $q->where('tanggal', '>=', $request->tanggal_mulai)
                               ->where('tanggal', '<=', $request->tanggal_selesai);
                         }])->get();