app/Http/Controllers/API/JadwalPelajaranController.php

select * from `jadwal_pelajarans` where `tahun_ajaran` is null and `kelas` is null and `semester` is null order by `jam_pelajaran` asc
---
    public function read(Request $request) {
        if($request->req == 'table') {
            $data = JadwalPelajaran::with('mataPelajaran', 'kelas')->where('tahun_ajaran', $request->tahun_ajaran)
                                   ->where('kelas_id', $request->kelas_id)
                                   ->where('semester', $request->semester)
                                   ->orderBy('jam_pelajaran')
                                   ->get();