app/Http/Controllers/API/MataPelajaranController.php

    public function read(Request $request) {
        if($request->req == 'table') {
            $data = MataPelajaran::join('gurus', 'gurus.id', 'guru_id')
                                 ->where(function($q) use($request){
                                    $q->where('nama_pelajaran', 'like', "%$request->search%")
                                      ->orWhere('nama_guru', 'like', "%$request->search%");;
                                })->select('mata_pelajarans.*', 'nama_guru')
                                 ->paginate($request->per_page);
---
select `mata_pelajarans`.*, `nama_guru` from `mata_pelajarans` inner join `gurus` on `gurus`.`id` = `guru_id` where (`nama_pelajaran` like '%%') limit 15 offset 0
select count(*) as aggregate from `mata_pelajarans` inner join `gurus` on `gurus`.`id` = `guru_id` where (`nama_pelajaran` like '%%')