app/Http/Controllers/Admin/Fungsionaris/GuruController.php


        elseif($request->req == 'delete') {
            $obj = Guru::find($request->id);
            $obj->delete();
---
update `gurus` set `deleted_at` = '2021-02-16 02:28:49', `gurus`.`updated_at` = '2021-02-16 02:28:49' where `id` = 3
delete from `gurus` where `id` = 2