app/Http/Controllers/Admin/Fungsionaris/GuruController.php

select * from `gurus` inner join `pegawais` on `gurus`.`pegawai_id` = `pegawais`.`id`
select * from `pegawais` where `user_id` = 2 and `pegawais`.`deleted_at` is null order by `created_at` desc
select * from `status_gurus` where `user_id` = 2 and `status_gurus`.`deleted_at` is null order by `created_at` desc
---
    public function index(Request $request) {
        $addons = Addons::where('user_id', auth()->user()->id)->first();

        if ($request->ajax()) {
            $data = Guru::whereHas('user', function($query){
                $query->where('id_sekolah', auth()->user()->id_sekolah);
            })->get();
            return DataTables::of($data)
                ->addColumn('action', function ($data) {
                    $button = '<button type="button" data-id="' . $data->id . '" class="edit btn btn-mini btn-info shadow-sm"><i class="fa fa-pencil-alt"></i></button>';
                    $button .= '&nbsp;&nbsp;&nbsp;<button type="button" data-id="' . $data->id . '" class="delete btn btn-mini btn-danger shadow-sm"><i class="fa fa-trash"></i></button>';
                    return $button;
                })->addColumn('nama_pegawai', function($data){
                    return $data->pegawai->name;
                })->addColumn('nama_status', function($data){
                    return $data->statusGuru->name;
                })
                ->rawColumns(['action'])
                ->addIndexColumn()
                ->make(true);
        }
        // $pegawai = Pegawai::where('user_id', Auth::id())->latest()->get();
        // $user = User::sekolah();
        $pegawai = Pegawai::join('users', 'pegawais.user_id', 'users.id')
            ->where('users.id_sekolah', auth()->user()->id_sekolah)
            ->get(['pegawais.*']);
        $status = StatusGuru::where('user_id', Auth::id())->latest()->get();

insert into `gurus` (`nama_guru`, `nip`, `nik`, `gelar_depan`, `gelar_belakang`, `tempat_lahir`, `tanggal_lahir`, `jenis_kelamin`, `agama`, `status`, `alamat_tinggal`, `provinsi`, `kabupaten`, `kecamatan`, `dusun`, `rt`, `rw`, `kode_pos`, `no_telepon_rumah`, `no_telepon`, `email`, `username`, `password`, `tanggal_mulai`, `bagian_guru`, `tahun_ajaran`, `semester`, `jenjang`, `updated_at`, `created_at`) values ('asdasd', '234', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '2021-02-17 05:10:17', '2021-02-17 05:10:17')
---
    public function store(Request $request) {
        // Validation rules
        $rules = [
            'pegawai_id' => 'required',
            'status_guru_id' => 'required',
            'status' => 'required',
        ];

        $validator = Validator::make($request->all(), $rules);

        if ($validator->fails()) {
            return response()->json([
                'error' => "Data masih kosong",
                'errors' => $validator->errors()
            ]);
        }

        // Get user id pegawai
        $pegawai = Pegawai::findOrFail($request->pegawai_id);
        $user_id = User::findOrFail($pegawai->user_id);

        $request['user_id'] = $user_id->id;

        // get Roles to attach user roles
        $role = Role::where('name', 'guru')->first();

        // attach
        $user_id->roles()->attach($role->id);

        // Create Guru
        $guru = Guru::create($request->all());