app/Http/Controllers/Admin/Fungsionaris/PegawaiController.php

    public function index(Request $request) {
        $addons = Addons::where('user_id', auth()->user()->id)->first();
        if ($request->ajax()) {
            $data = Pegawai::whereHas('user', function($query){
                $query->where('id_sekolah', auth()->user()->id_sekolah);
            })->get();
---
select * from `pegawais` where exists (select * from `users` where `pegawais`.`user_id` = `users`.`id` and `id_sekolah` is null and `users`.`deleted_at` is null) and `pegawais`.`deleted_at` is null