app/Http/Controllers/Admin/EVoting/PemilihanController.php

select * from `calon_kandidats` where `calon_kandidats`.`deleted_at` is null
---
    public function index(Request $request) {
        if ($request->ajax()) {
            $data = Pemilihan::latest()->get();
            return DataTables::of($data)
                ->addColumn('action', function ($data) {
                    $button = '<button type="button" id="'.$data->id.'" class="edit btn btn-mini btn-info shadow-sm">Edit</button>';
                    $button .= '&nbsp;&nbsp;&nbsp;<button type="button" id="'.$data->id.'" class="delete btn btn-mini btn-danger shadow-sm">Delete</button>';
                    return $button;
                })
                ->rawColumns(['action'])
                ->addIndexColumn()
                ->make(true);
        }
        $ck = CalonKandidat::all();