app/Http/Controllers/Admin/Referensi/BagianPegawaiController.php

update `bagian_pegawais` set `name` = 'Gurus', `bagian_pegawais`.`updated_at` = '2021-02-19 19:09:50' where `id` = '1' and `bagian_pegawais`.`deleted_at` is null
---
    public function update(Request $request) {
        // validasi
        $rules = [
            'pegawai'  => 'required|max:100',
        ];

        $message = [
            'pegawai.required' => 'Kolom ini gaboleh kosong',
        ];

        $validator = Validator::make($request->all(), $rules, $message);

        if ($validator->fails()) {
            return response()
                ->json([
                    'errors' => $validator->errors()->all()
                ]);
        }

        BagianPegawai::whereId($request->hidden_id)->update([
            'name'  => $request->input('pegawai'),
        ]);