app/Http/Controllers/Admin/Referensi/JenjangPegawaiController.php

update `jenjang_pegawais` set `deleted_at` = '2021-02-19 13:56:08', `jenjang_pegawais`.`updated_at` = '2021-02-19 13:56:08' where `id` = 1
---
    public function destroy($id) {
        $status = JenjangPegawai::find($id);
        $status->delete();