app/Http/Controllers/Admin/Referensi/SemesterController.php

select * from `semesters` where `semesters`.`deleted_at` is null order by `created_at` desc
---
    public function index(Request $request) {
        if ($request->ajax()) {
            $data = Semester::latest()->get();

update `semesters` set `deleted_at` = '2021-02-19 19:17:51', `semesters`.`updated_at` = '2021-02-19 19:17:51' where `id` = 1
---
    public function destroy($id) {
        $semester = Semester::find($id);
        $semester->delete();