app/Http/Controllers/Admin/Referensi/StatusGuruController.php

    public function index(Request $request) {
        if ($request->ajax()) {
            $data = StatusGuru::latest()->get();
---
select * from `status_gurus` where `status_gurus`.`deleted_at` is null order by `created_at` desc

    public function update(Request $request) {
        // validasi
        $rules = [
            'status_guru'  => 'required|max:100',
        ];

        $message = [
            'status_guru.required' => 'Kolom ini gaboleh kosong',
        ];

        $validator = Validator::make($request->all(), $rules, $message);

        if ($validator->fails()) {
            return response()
                ->json([
                    'errors' => $validator->errors()->all()
                ]);
        }

        $status = StatusGuru::whereId($request->input('hidden_id'))->update([
            'name'  => $request->input('status_guru'),
        ]);
---
update `status_gurus` set `name` = 'PNS', `status_gurus`.`updated_at` = '2021-02-19 19:25:03' where `id` = '1' and `status_gurus`.`deleted_at` is null

    public function destroy($id) {
        $status = StatusGuru::find($id);
        $status->delete();
---
update `status_gurus` set `deleted_at` = '2021-02-19 13:55:43', `status_gurus`.`updated_at` = '2021-02-19 13:55:43' where `id` = 1