app/Http/Controllers/Admin/Absensi/SiswaController.php

    public function index(Request $request) {
        $kelas = TingkatanKelas::all();
        $data = [];

        if($request->req == 'table') {
            $data = Siswa::with(['kelas',
                                 'absensi' => function($q) use($request){
                                     $q->where('tanggal', $request->tanggal)->where('kelas_id', $request->kelas_id);
                                }])
                         ->where('id_tingkatan_kelas', $request->kelas_id)
                         ->orderBy('nama_lengkap')
                         ->get();
---
select * from `tingkatan_kelas` where `tingkatan_kelas`.`deleted_at` is null
select * from `absensis` where `absensis`.`siswa_id` in (1, 2) and `tanggal` = '2021-02-21' and `kelas_id` = '2'
select * from `siswas` where `id_tingkatan_kelas` = '2' and `siswas`.`deleted_at` is null order by `nama_lengkap` asc
select * from `tingkatan_kelas` where `tingkatan_kelas`.`id` in (2) and `tingkatan_kelas`.`deleted_at` is null