app/Http/Controllers/Siswa/Pelajaran/JadwalPelajaranSiswaController.php

select * from `jadwal_pelajarans` where `tahun_ajaran` = '2019/2020' and `kelas_id` = '2' and `semester` = 'ganjil' order by `jam_pelajaran` asc
select * from `mata_pelajarans` where `mata_pelajarans`.`id` in (15)
select * from `jadwal_pelajarans` where `tahun_ajaran` = '2019/2020' and `kelas` = 'X' and `semester` = 'ganjil' order by `jam_pelajaran` asc
---
    public function index(Request $request) {
        $data = null;

        if($request->req == 'table') {
            $data = JadwalPelajaran::with('mataPelajaran')
                                   ->where('tahun_ajaran', $request->tahun_ajaran)
                                   ->where('kelas_id', $request->kelas_id)
                                   ->where('semester', $request->semester)
                                   ->orderBy('jam_pelajaran')
                                   ->get();

                                   $data = $data->groupBy('hari');

        }

        elseif($request->req == 'single') {
            $obj = JadwalPelajaran::findOrFail($request->id);

select * from `tingkatan_kelas` where `tingkatan_kelas`.`deleted_at` is null
select mata_pelajarans.id, concat(nama_pelajaran, " | ", nama_guru) as name from `mata_pelajarans` inner join `gurus` on `gurus`.`id` = `guru_id`
---
            ['id' => '9', 'label' => '(14:45 - 15:30)' ],
        ];

        $kelas = TingkatanKelas::all();

        $tahun_ajaran = ['2019/2020', '2020/2021'];

        $pelajaran = MataPelajaran::join('gurus', 'gurus.id', 'guru_id')->selectRaw('mata_pelajarans.id, concat(nama_pelajaran, " | ", nama_guru) as name')->get();