app/User.php

select `sekolahs`.* from `users` inner join `sekolahs` on `users`.`id_sekolah` = `sekolahs`.`id` where `users`.`id` = 2 and `users`.`deleted_at` is null limit 1
---
    public static function sekolah() {
        return self::join('sekolahs', 'users.id_sekolah', 'sekolahs.id')
            ->where('users.id', auth()->user()->id)
            ->first('sekolahs.*');