app/Http/Controllers/Admin/Pelajaran/JadwalPelajaranController.php

    public function index(Request $request) {
        $data = null;

        if($request->req == 'table') {
            $data = JadwalPelajaran::with('mataPelajaran')
                                   ->where('tahun_ajaran', $request->tahun_ajaran)
                                   ->where('kelas_id', $request->kelas_id)
                                   ->where('semester', $request->semester)
                                   ->orderBy('jam_pelajaran')
                                   ->get();
---
select * from `jadwal_pelajarans` where `tahun_ajaran` = '2019/2020' and `kelas_id` = '2' and `semester` = 'ganjil' order by `jam_pelajaran` asc
select * from `mata_pelajarans` where `mata_pelajarans`.`id` in (12)

            ['id' => '9', 'label' => '(14:45 - 15:30)' ],
        ];

        $kelas = TingkatanKelas::all();

        $tahun_ajaran = ['2019/2020', '2020/2021'];

        $pelajaran = MataPelajaran::join('gurus', 'gurus.id', 'guru_id')->selectRaw('mata_pelajarans.id, concat(nama_pelajaran, " | ", nama_guru) as name')->get();
---
select * from `tingkatan_kelas` where `tingkatan_kelas`.`deleted_at` is null
select mata_pelajarans.id, concat(nama_pelajaran, " | ", nama_guru) as name from `mata_pelajarans` inner join `gurus` on `gurus`.`id` = `guru_id`

    public function write(Request $request) {

        if($request->req == 'write') {
            $obj = JadwalPelajaran::find($request->id);

            if(!$obj) {
                $obj = new JadwalPelajaran();
            }

            $obj->kelas_id = $request->kelas_id;
            $obj->mata_pelajaran_id = $request->mata_pelajaran_id;
            $obj->hari = $request->hari;
            $obj->semester = $request->semester;
            $obj->tahun_ajaran = $request->tahun_ajaran;
            $obj->jam_pelajaran = $request->jam_pelajaran;
            $obj->keterangan = $request->keterangan;
            $obj->save();
---
insert into `jadwal_pelajarans` (`kelas_id`, `mata_pelajaran_id`, `hari`, `semester`, `tahun_ajaran`, `jam_pelajaran`, `keterangan`, `updated_at`, `created_at`) values ('1', '2', 'senin', 'ganjil', '2019/2020', '2', '', '2021-02-18 09:13:42', '2021-02-18 09:13:42')