app/Http/Controllers/Admin/Pelajaran/MataPelajaranController.php

select `mata_pelajarans`.*, `nama_guru` from `mata_pelajarans` inner join `gurus` on `gurus`.`id` = `guru_id`
select * from `gurus`
---
    public function index(Request $request) {
        if($request->req == 'table') {
            return DataTables::of(MataPelajaran::join('gurus', 'gurus.id', 'guru_id')->select('mata_pelajarans.*', 'nama_guru')->get())->addIndexColumn()->toJson();
        }
        if($request->req == 'single') {
            return response()->json(MataPelajaran::findOrFail($request->id));
        }
        $guru = Guru::all();

insert into `mata_pelajarans` (`nama_pelajaran`, `kode_pelajaran`, `guru_id`, `aktif`, `keterangan`, `updated_at`, `created_at`) values ('penjas', '34', '2', 1, 'keete', '2021-02-19 23:55:08', '2021-02-19 23:55:08')
delete from `mata_pelajarans` where `id` = 10
---
    public function write(Request $request) {
        if($request->req == 'write') {
            $obj = MataPelajaran::find($request->id);

            if(!$obj){
                $obj = new MataPelajaran();
            }

            $obj->nama_pelajaran = $request->nama_pelajaran;
            $obj->kode_pelajaran = $request->kode_pelajaran;
            $obj->guru_id = $request->guru_id;
            $obj->aktif = $request->aktif == 'on';
            $obj->keterangan = $request->keterangan ?? '';
            $obj->save();
            return response()->json($obj);


        }
        elseif($request->req == 'delete') {
            MataPelajaran::find($request->id)->delete();