app/Http/Controllers/Admin/PesertaDidik/SiswaController.php

    public function index() {
        $kelases = TingkatanKelas::all();
        $siswas = Siswa::with('kelas')->get();
---
select * from `tingkatan_kelas` where `tingkatan_kelas`.`deleted_at` is null
select * from `siswas` where `siswas`.`deleted_at` is null