app/Http/Controllers/Guru/Absensi/RekapSiswaGuruController.php

    public function index(Request $request) {
        $data = [];
        if($request->req == 'table') {
            $data = Siswa::where('id_tingkatan_kelas', $request->kelas_id)
                        ->with('kelas')
                        ->orderBy('nama_lengkap')
                         ->with(['absensis' => function($q) use($request){
                             $q->where('tanggal', '>=', $request->tanggal_mulai)
                               ->where('tanggal', '<=', $request->tanggal_selesai);
                         }])->get();

            //return response()->json($data);
        }

        $kelas = TingkatanKelas::all();
---
select * from `tingkatan_kelas` where `tingkatan_kelas`.`deleted_at` is null