app/Http/Controllers/Superadmin/ListSekolahController.php



        // Get Roles
        $adminRole = Role::where('name', 'admin')->first();
---
select * from `roles` where `name` = 'admin' limit 1