app/Http/Controllers/Superadmin/Referensi/KabupatenKotaController.php

    public function index(Request $request) { //
        if ($request->ajax()) {
            $data = KabupatenKota::latest()->get();
---
select * from `kabupaten_kotas` where `kabupaten_kotas`.`deleted_at` is null order by `created_at` desc